Show / Hide Table of Contents
Class ModelBIM
Inheritance
System.Object
ModelBIM
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[DataContract]
public class ModelBIM
Properties
Improve this Doc   View Source
Items
Declaration
[DataMember]
public List<BIMItemId> Items { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<BIMItemId>
Improve this Doc   View Source
Messages
Declaration
[DataMember]
public OpenMessages Messages { get; set; }
Property Value
 Type |  Description
 OpenMessages
Improve this Doc   View Source
Model
Declaration
[DataMember]
public OpenModel Model { get; set; }
Property Value
 Type |  Description
 OpenModel
Improve this Doc   View Source
Project
Declaration
[DataMember]
public string Project { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
RequestedItems
Declaration
[DataMember]
public RequestedItemsType RequestedItems { get; set; }
Property Value
 Type |  Description
 RequestedItemsType
Improve this Doc   View Source
Results
Declaration
[DataMember]
public OpenModelResult Results { get; set; }
Property Value
 Type |  Description
 OpenModelResult
 Improve this Doc
 View Source